yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152c8.h
#define MASK_PG_DDR_DDR0         0x01
#define MASK_PG_DDR_DDR1         0x02
#define MASK_PG_DDR_DDR2         0x04
#define MASK_PG_DDR_DDR3         0x08
#define MASK_PG_DDR_DDR4         0x10
#define MASK_PG_DDR_DDR5         0x20
#define MASK_PG_DDR_DDR6         0x40
#define MASK_PG_DDR_DDR7         0x80

#define MASK_PG_CR1_C10          0x01
#define MASK_PG_CR1_C11          0x02
#define MASK_PG_CR1_C12          0x04
#define MASK_PG_CR1_C13          0x08
#define MASK_PG_CR1_C14          0x10
#define MASK_PG_CR1_C15          0x20
#define MASK_PG_CR1_C16          0x40
#define MASK_PG_CR1_C17          0x80

#define MASK_PG_CR2_C20          0x01
#define MASK_PG_CR2_C21          0x02
#define MASK_PG_CR2_C22          0x04
#define MASK_PG_CR2_C23          0x08
#define MASK_PG_CR2_C24          0x10
#define MASK_PG_CR2_C25          0x20
#define MASK_PG_CR2_C26          0x40
#define MASK_PG_CR2_C27          0x80


/*-------------------------------------------------------------------------
 *      Port H register definitions
 *-----------------------------------------------------------------------*/
/* Port H data output latch register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ODR0        : 1;
  unsigned char ODR1        : 1;
  unsigned char ODR2        : 1;
  unsigned char ODR3        : 1;
  unsigned char ODR4        : 1;
  unsigned char ODR5        : 1;
  unsigned char ODR6        : 1;
  unsigned char ODR7        : 1;
} __BITS_PH_ODR;
#endif
__IO_REG8_BIT(PH_ODR,      0x5023, __READ_WRITE, __BITS_PH_ODR);

/* Port H input pin value register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IDR0        : 1;
  unsigned char IDR1        : 1;
  unsigned char IDR2        : 1;
  unsigned char IDR3        : 1;
  unsigned char IDR4        : 1;
  unsigned char IDR5        : 1;
  unsigned char IDR6        : 1;
  unsigned char IDR7        : 1;
} __BITS_PH_IDR;
#endif
__IO_REG8_BIT(PH_IDR,      0x5024, __READ, __BITS_PH_IDR);

/* Port H data direction register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DDR0        : 1;
  unsigned char DDR1        : 1;
  unsigned char DDR2        : 1;
  unsigned char DDR3        : 1;
  unsigned char DDR4        : 1;
  unsigned char DDR5        : 1;
  unsigned char DDR6        : 1;
  unsigned char DDR7        : 1;
} __BITS_PH_DDR;
#endif
__IO_REG8_BIT(PH_DDR,      0x5025, __READ_WRITE, __BITS_PH_DDR);

/* Port H control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C10         : 1;
  unsigned char C11         : 1;
  unsigned char C12         : 1;
  unsigned char C13         : 1;
  unsigned char C14         : 1;
  unsigned char C15         : 1;
  unsigned char C16         : 1;
  unsigned char C17         : 1;
} __BITS_PH_CR1;
#endif
__IO_REG8_BIT(PH_CR1,      0x5026, __READ_WRITE, __BITS_PH_CR1);

/* Port H control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C20         : 1;
  unsigned char C21         : 1;
  unsigned char C22         : 1;
  unsigned char C23         : 1;
  unsigned char C24         : 1;
  unsigned char C25         : 1;
  unsigned char C26         : 1;
  unsigned char C27         : 1;
} __BITS_PH_CR2;
#endif
__IO_REG8_BIT(PH_CR2,      0x5027, __READ_WRITE, __BITS_PH_CR2);


/*-------------------------------------------------------------------------
 *      Port H bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define PH_ODR_ODR0              PH_ODR_bit.ODR0
#define PH_ODR_ODR1              PH_ODR_bit.ODR1
#define PH_ODR_ODR2              PH_ODR_bit.ODR2
#define PH_ODR_ODR3              PH_ODR_bit.ODR3
#define PH_ODR_ODR4              PH_ODR_bit.ODR4
#define PH_ODR_ODR5              PH_ODR_bit.ODR5
#define PH_ODR_ODR6              PH_ODR_bit.ODR6
#define PH_ODR_ODR7              PH_ODR_bit.ODR7

#define PH_IDR_IDR0              PH_IDR_bit.IDR0
#define PH_IDR_IDR1              PH_IDR_bit.IDR1
#define PH_IDR_IDR2              PH_IDR_bit.IDR2
#define PH_IDR_IDR3              PH_IDR_bit.IDR3
#define PH_IDR_IDR4              PH_IDR_bit.IDR4
#define PH_IDR_IDR5              PH_IDR_bit.IDR5
#define PH_IDR_IDR6              PH_IDR_bit.IDR6
#define PH_IDR_IDR7              PH_IDR_bit.IDR7

#define PH_DDR_DDR0              PH_DDR_bit.DDR0
#define PH_DDR_DDR1              PH_DDR_bit.DDR1
#define PH_DDR_DDR2              PH_DDR_bit.DDR2
#define PH_DDR_DDR3              PH_DDR_bit.DDR3
#define PH_DDR_DDR4              PH_DDR_bit.DDR4
#define PH_DDR_DDR5              PH_DDR_bit.DDR5
#define PH_DDR_DDR6              PH_DDR_bit.DDR6
#define PH_DDR_DDR7              PH_DDR_bit.DDR7

#define PH_CR1_C10               PH_CR1_bit.C10
#define PH_CR1_C11               PH_CR1_bit.C11
#define PH_CR1_C12               PH_CR1_bit.C12
#define PH_CR1_C13               PH_CR1_bit.C13
#define PH_CR1_C14               PH_CR1_bit.C14
#define PH_CR1_C15               PH_CR1_bit.C15
#define PH_CR1_C16               PH_CR1_bit.C16
#define PH_CR1_C17               PH_CR1_bit.C17

#define PH_CR2_C20               PH_CR2_bit.C20
#define PH_CR2_C21               PH_CR2_bit.C21
#define PH_CR2_C22               PH_CR2_bit.C22
#define PH_CR2_C23               PH_CR2_bit.C23
#define PH_CR2_C24               PH_CR2_bit.C24
#define PH_CR2_C25               PH_CR2_bit.C25
#define PH_CR2_C26               PH_CR2_bit.C26
#define PH_CR2_C27               PH_CR2_bit.C27

#endif

/*-------------------------------------------------------------------------
 *      Port H bit masks
 *-----------------------------------------------------------------------*/
#define MASK_PH_ODR_ODR0         0x01
#define MASK_PH_ODR_ODR1         0x02
#define MASK_PH_ODR_ODR2         0x04
#define MASK_PH_ODR_ODR3         0x08
#define MASK_PH_ODR_ODR4         0x10
#define MASK_PH_ODR_ODR5         0x20
#define MASK_PH_ODR_ODR6         0x40
#define MASK_PH_ODR_ODR7         0x80

#define MASK_PH_IDR_IDR0         0x01
#define MASK_PH_IDR_IDR1         0x02
#define MASK_PH_IDR_IDR2         0x04
#define MASK_PH_IDR_IDR3         0x08
#define MASK_PH_IDR_IDR4         0x10
#define MASK_PH_IDR_IDR5         0x20
#define MASK_PH_IDR_IDR6         0x40
#define MASK_PH_IDR_IDR7         0x80

